Revit 2027 API
IFCGeometryInfo.GetSurfaces Method
 Gets the IfcSurface handles created representing the processed geometry and stored in this object.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<IFCAnyHandle> GetSurfaces()
Public Function GetSurfaces As ICollection(Of IFCAnyHandle)
public:
ICollection<IFCAnyHandle^>^ GetSurfaces()
member GetSurfaces : unit -> ICollection<IFCAnyHandle>
Return Value
ICollection<IFCAnyHandle>
 The collection of surface handles.
See Also
Reference
IFCGeometryInfo Class
Autodesk.Revit.DB.IFC Namespace